app/controllers/photos_controller.rb

SELECT * FROM `albums` ORDER BY title
INSERT INTO `photos` (`name`, `thumbnail`, `updated_at`, `extension`, `album_id`, `path`, `created_at`) VALUES('Balhblah', 0, '2008-12-20 14:58:47', NULL, NULL, 'photos/2008122015584783.jpg', '2008-12-20 14:58:47')
---
  def upload_photo
    @albums = Album.find :all, :order => "title"
    @photo = Photo.new(params[:photo])
    if request.post?
      @photo.save

SELECT * FROM `photos` ORDER BY photos.id DESC LIMIT 1
---
  def display_photo
    @photo = Photo.find :last