app/controllers/user_controller.rb

  def add_user
    @user = User.new(params[:user])
    if request.post?
      @user.save
---
INSERT INTO `users` (`updated_at`, `gender`, `birth_date`, `first_name`, `last_name`, `created_at`) VALUES('2008-12-19 23:12:06', '1', '2004-03-04 23:00:00', 'krikis', 'esprits', '2008-12-19 23:12:06')

  def show_users
    @users = User.find :all, :order => "birth_date"
---
SELECT * FROM `users` ORDER BY birth_date